# -*- coding: utf-8 -*-
i=raw_input("Παρακαλώ εισάγεται τους αριθμους διαζωρισμένους μεταξύ τους με κενο.\n")
i = i.split()
e = 0
result = ""
while (len(i) < 3):
    if (len(i) == 0):
        i.append(0)
    elif (len(i) == 1):
        i.append(1)
    elif (len(i) == 2):
        i.append(1)
a = int(i[0])
b = int(i[1])
c = int(i[2])
for j in range(1,len(i) + 1):
    if ((int(i[j - 1]) < 0) | (int(i[j - 1])) != float(i[j - 1])):
        e = e + 1
        print str(e) + "e"
if (e > 0):
    print "Παρακαλώ εισάγεται έναν φυσικό αριθμό"
elif ((a == 0) | (a == 1)):
    print a
elif ((b == 1) | ((b * c) < 4)):
    result = a**(b**c)
    result = str(result)
    result = result[len(result)-1]
    print result
else:
    a = str(a)
    a = a[len(a) - 1]
    a = int(a)
    if ((a == 5) & (b != 0)):
        d = 5
    elif ((a % 2) == 1):
        d = 1
    elif ((a % 2) == 0):
        d = 6
    #Παρακάτω χρησημοποιώ θεωρεία αριθμών modulo
    c = c % 2
    b = b % 4
    if (b == 1):
        result = d * a
    elif (b == 2):
        if (c == 0):
            result = d
        elif (c == 1):
            result = d * (a**2)
    elif (b == 3):
        if (c == 0):
            result = d * a
        elif (c == 1):
            result = d * (a**3)
    elif (b == 0):
        result = d
    result = str(result)
    result = int(result[len(result) - 1])
    print result
#Μεθοδολογία : Γνωρίζω ότι μόνο από το πρώτο ψηφείο της βάσης (του πρώτου αριθμού που εισάγουμε) θα εξαρτιθεί το αποτέλεσμα (Αποδυκνείεται με διόνυμο του Νεύτωνα). Γνωρίζω ότι για την συνάρτηση F(x)=a**x για κάθε x και a ανοίκει στου φυσικούς το αποτέλεσμα του τελευτοαίου ψηφείου της F θα αλλάζει περιοδικά (Ανά 4 αριθμούς) και ανά 4 αριθμούς και ανάλογα με το αν ο αριθμός είναι περιττός (Αποτέλεσμα1)ή άρτιος (Αποτέλεσμα6)ή 5 (Αποτέλεσμα5)θα βγάζει το ίδιο αποτέλεσμα στο τελευταίο ψηφείο της F.Άρα μα την συνάρτηση G(x)=Το τελευταίο ψηφείο της((a**y)*d) όπου α το τελευταίο ψηφείο του πρώτου αριθμού που βάζουμε (της βάσης του αριθμού που ψάχνουμε) d ο αριθμός που επαναλαμβάνεται περιοδικά ανα 4 φυσικούς αριθμούς και z=x%4 (Το z βρίσκεται με θεωρεία αριθμών και το modulo).Αφού a**x=(a**(x-z)*a**z)=d*a**z[αφού (x-z)%4=0]
